# -*- coding: utf-8 -*-

from jieba.analyse import *
import jieba
import os, re
from Meifu import text_abstract
import matplotlib.pyplot as plt
import openpyxl
from wordcloud import WordCloud
import pandas
import csv

def get_keywords(text,path2):
    # set_stop_words('D:\Python\Project\Meifu\Meifu\stopwords-master\hit_stopwords.txt')
    # set_stop_words('./stopwords-master/hit_stopwords.txt')
    # set_stop_words('../stopwords-master/hit_stopwords.txt')
    set_stop_words('./stopwords-master/hit_stopwords.txt')
    # set_stop_words(path2)
    # jieba.load_userdict("D:\Python\Project\Meifu\Meifu\stopwords-master\ew_words.txt")
    # jieba.load_userdict("./stopwords-master/ew_words.txt")
    # jieba.load_userdict("../Meifu/stopwords-master/ew_words.txt")
    jieba.load_userdict("./stopwords-master/ew_words.txt")
    jieba.load_userdict("./stopwords-master/日本排海.txt")

    jieba.add_word('金美孚', tag='n')
    jieba.add_word('美孚一号', tag='n')
    jieba.add_word('美孚1号', tag='n')
    jieba.add_word('金美孚一号', tag='n')
    jieba.add_word('爱车一族', tag='n')
    jieba.add_word('爱车', tag='n')
    jieba.add_word('做保养', tag='v')
    jieba.add_word('坑爹', tag='a')
    jieba.add_word('合成机油', tag='n')
    jieba.add_word('半合成机油', tag='n')
    jieba.add_word('矿物油', tag='n')
    jieba.add_word('合成科技', tag='n')
    jieba.add_word('合成技术', tag='n')
    jieba.add_word('合成技术油', tag='n')
    jieba.add_word('上上之选', tag='a')
    jieba.add_word('4S店', tag='a')
    jieba.add_word('三桶油', tag='a')
    jieba.add_word('4S', tag='n')
    jieba.add_word('超凡喜力', tag='n')
    jieba.add_word('极护', tag='n')
    jieba.add_word('涡轮增压', tag='n')
    jieba.add_word('道达尔', tag='n')
    jieba.add_word('力魔', tag='n')
    jieba.add_word('龙蟠', tag='n')
    jieba.add_word('四儿子', tag='n')
    jieba.add_word('苏宁易购', tag='n')
    jieba.add_word('途虎', tag='n')
    jieba.add_word('一千', tag='n')
    jieba.add_word('三千', tag='n')
    jieba.add_word('五千', tag='n')
    jieba.add_word('八千', tag='n')
    jieba.add_word('一万', tag='n')
    jieba.add_word('一千公里', tag='n')
    jieba.add_word('三千公里', tag='n')
    jieba.add_word('五千公里', tag='n')
    jieba.add_word('八千公里', tag='n')
    jieba.add_word('一万公里', tag='n')
    jieba.add_word('美孚黑霸王', tag='n')
    jieba.add_word('恒久动力驰骋天地', tag='n')
    jieba.add_word('恒久动力研究所', tag='n')
    # jieba.add_word('驰骋天地', tag='n')
    jieba.add_word('克莱汤普森', tag='n')
    jieba.add_word('心不设限', tag='n')
    # jieba.add_word('不设限', tag='n')
    jieba.add_word('突破时刻', tag='n')
    jieba.add_word('韩东君', tag='n')
    jieba.add_word('日本', tag='n')
    jieba.add_word('日本', tag='n')
    jieba.add_word('砍砍', tag='n')
    jieba.add_word('废水', tag='n')
    jieba.add_word('污水', tag='n')
    jieba.add_word('无耻至极', tag='n')
    jieba.add_word('抵制日货', tag='n')
    jieba.add_word('岸田文雄', tag='n')
    jieba.add_word('岸田', tag='n')
    jieba.add_word('核废水', tag='n')
    jieba.add_word('核污水', tag='n')
    jieba.add_word('核污染水', tag='n')
    jieba.add_word('日本人', tag='n')
    jieba.add_word('北赤道', tag='n')
    jieba.add_word('日本国', tag='n')
    jieba.add_word('日本岛', tag='n')
    jieba.add_word('侵华战争', tag='n')
    jieba.add_word('火速围观', tag='n')
    jieba.add_word('美丽国', tag='n')
    jieba.add_word('漂亮国', tag='n')
    jieba.add_word('嘴炮', tag='n')
    jieba.add_word('小日本', tag='n')
    jieba.add_word('全世界人', tag='n')
    jieba.add_word('伊斯兰教', tag='n')
    jieba.add_word('伊斯兰', tag='n')
    jieba.add_word('巴以冲突', tag='n')
    jieba.add_word('以巴冲突', tag='n')
    jieba.add_word('以牙還牙', tag='n')
    jieba.add_word('以牙還牙', tag='n')
    jieba.add_word('猶太人', tag='n')
    jieba.add_word('犹太人', tag='n')
    # jieba.add_word('美孚黑霸王', tag='n')
    # print(path)

    text = re.sub(r"美孚1号", "美孚一号", text)
    text = re.sub(r"一号", "美孚一号", text)
    text = re.sub(r"4儿子", "4S", text)
    text = re.sub(r"4S", "四儿子", text)
    text = re.sub(r"五千", "五千公里", text)
    text = re.sub(r"一万", "一万公里", text)
    text = re.sub(r"4s", "四儿子", text)
    text = re.sub(r"妹夫", "美孚", text)
    text = re.sub(r"狗东", "京东", text)
    text = re.sub(r"2000", "两千", text)
    text = re.sub(r"3000", "三千", text)
    text = re.sub(r"1000", "一千", text)
    text = re.sub(r"5000", "五千", text)
    text = re.sub(r"6000", "六千", text)
    text = re.sub(r"7000", "七千", text)
    text = re.sub(r"8000", "八千", text)
    text = re.sub(r"10000", "一万", text)
    text = re.sub(r"一千", "一千公里", text)
    text = re.sub(r"三千", "三千公里", text)
    text = re.sub(r"八千", "八千公里", text)
    text = re.sub(r"15000", "一万五千", text)
    text = re.sub(r"18000", "一万八千", text)
    text = re.sub(r"20000", "两万", text)
    text = re.sub(r"30000", "三万", text)
    text = re.sub(r"50000", "五万", text)
    text = re.sub(r"100000", "十万", text)
    text = re.sub(r"一万五", "一万五千", text)
    text = re.sub(r"一万八", "一万八千", text)
    text = re.sub(r"黏度", "粘度", text)
    text = re.sub(r"黏稠度", "粘度", text)
    text = re.sub(r"粘稠度", "粘度", text)
    text = re.sub(r"金美孚", "金美", text)
    text = re.sub(r"霸王", "美孚黑霸王", text)
    text = re.sub(r"克莱", "克莱汤普森", text)
    text = re.sub(r"汤普森", "克莱汤普森", text)
    text = re.sub(r"日本", "", text)
    text = re.sub(r"砍砍", "", text)
    text = re.sub(r"废水", "核废水", text)
    text = re.sub(r"污水", "核污水", text)
    text = re.sub(r"核污水", "", text)
    text = re.sub(r"核废水", "", text)
    text = re.sub(r"微博", "", text)
    text = re.sub(r"坚决", "", text)
    text = re.sub(r"安全", "", text)
    # text = re.sub(r"猶太人", "犹太人", text)
    text = re.sub(r"恐怖份子", "恐怖分子", text)

    text = re.sub(r"[0-9\s+\.\!\/_,$%^*()?;；：:-【】+\"\']+|[+——！，;：:。？、~@#￥%……&*（）]+", ",", text)  # 替换标点符号

    print(text)
    import jieba.posseg as pseg
    word = pseg.cut(text)
    words = []

    # Top 200 keywords
    path3 = path2 + '.csv'
    # keywords = extract_tags(text, topK=300, withWeight=True)
    # keywords = textrank(text, topK=300, withWeight=True)
    # keywords = extract_tags(text, topK=100, allowPOS=('a', 'ad', 'an', 'Ag'), withWeight=True)
    keywords = extract_tags(text, topK=100, allowPOS=('n', 'nr', 'nrfg', 'ns', 'nt', 'nz'), withWeight=True)
    # keywords = extract_tags(text, topK=100, allowPOS=('vg', 'v', 'vn', 'vd'), withWeight=True)

    # print(keywords)
    # print(aaa)
    # keywords.to_csv(path3, index=False, encoding='utf_8_sig')

    with open(path3, 'w', encoding='utf_8_sig') as myFile:
        myWriter = csv.writer(myFile)
        for keyword, weight in extract_tags(text, topK=300, withWeight=True):
            print(keyword, weight)
            myWriter.writerow([keyword, str(weight)])

    print(keywords)
    keywords2 = []
    ret_words = {}
    for index, word in enumerate(keywords):
        # print(index, word)
        # print(keywords[index])
        if word[0] == '四儿子':
            print(1)
            test123 = ('4S', keywords[index][1])
            keywords2.append(test123)
        else:
            keywords2.append(word)

    # keywords2 = [('美观大方', 40), ('功能丰富', 1), ('灵活方便', 1), ('工艺精致', 8), ('噪音很小', 8), ('分量充足', 3), ('精致小巧', 1), ('携带方便', 8), ('简单好用', 25), ('使用简便', 3), ('设计感强', 1), ('尺寸合适', 4), ('简单大方', 5), ('大小合适', 13), ('运行平稳', 1), ('结实耐用', 10), ('时尚大气', 4), ('十分方便', 3), ('出行方便', 2), ('操作便捷', 2), ('漂亮好看', 3), ('使用方便', 1), ('操作简便', 8), ('空间宽敞', 9), ('不占空间', 4), ('十分小巧', 1), ('材质厚实', 1), ('不会化掉', 2), ('精致优雅', 1), ('简单方便', 1), ('外出方便', 1), ('方便实用', 2), ('精美别致', 1), ('结实牢固', 1), ('轻便小巧', 1), ('高档大气', 2), ('小巧不占地', 1), ('质感上乘', 1)]
    # keywords2 = [('空间宽敞', 1), ('空间宽阔', 1), ('美观大方', 32), ('携带方便', 5), ('外观漂亮', 2), ('方便实用', 6), ('时尚大气', 4), ('超强静音', 1), ('工艺精美', 1), ('简单好用', 17), ('小巧方便', 11), ('立显档次', 6), ('工艺精致', 8), ('小巧轻便', 3), ('简单大方', 2), ('精巧美观', 2), ('柔软舒服', 2), ('小巧不占地', 4), ('存储空间大', 1), ('声音变小', 1), ('完美匹配', 2), ('精致小巧', 25), ('颜色靓丽', 2), ('使用简便', 5), ('不占空间', 7), ('轻便灵巧', 1), ('毫无噪音', 1), ('好用易用', 2), ('小巧耐用', 1), ('大小合适', 1), ('小巧好用', 1), ('用着舒心', 1), ('加热挺快', 1), ('漂亮好看', 4), ('灵活方便', 1), ('十分小巧', 1)]
    # keywords2 = [('美观大方', 90), ('简单大方', 3), ('精致小巧', 81), ('空间宽敞', 3), ('使用简便', 2), ('声音轻柔', 3), ('结实耐用', 2), ('携带方便', 3), ('方便实用', 7), ('毫无噪音', 3), ('尺寸合适', 3), ('节能环保', 1), ('不占空间', 9), ('方便灵巧', 1), ('工艺精致', 6), ('简单好用', 40), ('漂亮好看', 19), ('小巧方便', 16), ('操作简便', 14), ('好用易用', 6), ('反应灵敏', 2), ('十分小巧', 2), ('固定牢靠', 2), ('小巧轻便', 3), ('时尚大气', 4), ('完美匹配', 2), ('小巧不占地', 1), ('性能优良', 1), ('声音沉稳', 1), ('颜色靓丽', 1)]
    # keywords2 = [('真男人', 10), ('保护', 10), ('战地记者', 20), ('君子生小国', 14), ('注意安全', 15), ('致敬', 14), ('先生大义', 12), ('切尔诺贝利', 16), ('辐岛', 18), ('心情沉重', 21), ('谎言', 30), ('讽刺', 35), ('自欺欺人', 20), ('避重就轻', 30), ('削足适履', 25)]
    # keywords2 = [('美观大方', 23), ('漂亮好看', 6), ('设计科学', 1), ('安装简便', 1), ('使用简便', 6), ('结实耐用', 3), ('时尚大气', 6), ('精致小巧', 8), ('不占空间', 1), ('简单便捷', 1), ('工艺精致', 11), ('操作简便', 1), ('声音轻柔', 2), ('设计合理', 1), ('高档大气', 4), ('静音性好', 1), ('小巧方便', 1), ('大小合适', 2), ('穿透力强', 1), ('空间宽阔', 1), ('噪音很小', 1), ('毫无噪音', 1), ('携带方便', 4), ('简约时尚', 1), ('精美别致', 1), ('小巧好用', 1), ('储物空间大', 1), ('空间宽敞', 1), ('简单好用', 1), ('直观方便', 1), ('干净清爽', 1), ('固定性强', 1), ('用起舒心', 1)]
    # keywords2 = [('富士山爆发',0.0989), ('强烈谴责',0.09646270631819322), ('坚决抵制日货',0.045316792278143586), ('日本人全喝了',0.09702957237018821), ('海水倒灌回日本',0.00919311282440533), ('危害全世界',0.0357397009146912), ('全世界买单',0.005168554692277769), ('西方失声',0.004473753369619473), ('美国默许',0.004214662323259898)]
    # keywords2 = [('富士山爆发',0.0989), ('强烈谴责',0.09646270631819322), ('坚决抵制日货',0.045316792278143586), ('日本人全喝了',0.09702957237018821), ('海水倒灌回日本',0.0219311282440533), ('危害全世界',0.0357397009146912), ('全世界买单',0.05168554692277769), ('西方失声',0.04473753369619473), ('美国默许',0.03214662323259898)]
    # keywords2 = [('#日本核污染水排海正式开始#',0.03097893), ('#日本核污染水已进入大海#',0.01631284), ('#日本核污染水下午排入海洋#',0.01064523), ('#日本核污染水排海最新情况#',0.00727200), ('#历史会记住日本政府这一笔#',0.00644288), ('#日本核污染水排放后约1000秒抵达大海#',0.00337323), ('#日本计划今年4次排放核污染水#',0.00337323), ('#日方强行排放核污染水极端自私不负责任#',0.00294110), ('#日本公关核污染水费用大于排污成本#',0.00248035), ('#日本将用700亿日元处理核污染水负面信息#',0.00248035), ('#岸田文雄午餐全是福岛食材#',0.00169580), ('#岸田大赞福岛鱼好吃促国民网购#',0.00167531), ('#浙江查获日本核辐射地区进口食品#',0.00159044), ('#日方反咬中国洗白不了排污入海劣迹#',0.00157366), ('#日本核污染水排海现场画面#',0.00107900), ('#日本核污染水排海4000天后海洋啥样#',0.00106495), ('#全面暂停日本水产品进口#',0.00106151), ('#福岛核电站附近渔港宛如无人区#',0.00051213), ('#主播说联播#',0.00041852), ('#日本为了自己划算不惜让全世界买单#',0.00041852), ('#福岛核污染水排海至少持续30年#',0.00041852), ('#日本核废水排海已经开始影响邻国#',0.00030064), ('#如果核污染水安全日方就没有必要排海#',0.00025493), ('#我国将跟踪研判福岛核污染水排海影响#',0.00021595), ('#我国开展管辖海域海洋辐射环境监测#',0.00021595), ('#3分11秒起底日本的核泄漏黑历史#',0.00014649), ('#一个骗字看日本核污水排海计划#',0.00014649), ('#中国食用盐产量能够满足需求#',0.00011028), ('#核污染水排海非个别国家开绿灯就畅行无阻#',0.00010853), ('#汪文斌反问除了美国还有哪国支持排海#',0.00010853), ('#我驻日本使领馆被大量日本电话骚扰#',0.00010030), ('#东电要求采访记者不能自由录音录像#',0.00009908), ('#总台记者实地探访日本核污染水排出设备#',0.00009908), ('#福岛核电站内部画面#',0.00009908), ('#严禁用日本水产品制作餐食#',0.00007228), ('#市场监管总局加强进口水产品安全抽检#',0.00007228), ('#国际原子能机构报告无法给予排海正当性#',0.00007224), ('#一图看懂日本核污染水排海危害#',0.00070105), ('#核污水排海不是风评被害是实际灾害#',0.00060795), ('#赵立坚#',0.00060005), ('#日本首次排海将持续17天左右#',0.00005555), ('#除了美国日方还能点出哪国支持排海#',0.00005046), ('#日本3天连发5次地震#',0.00048385), ('#福岛真相#',0.00048385), ('#日本已排放超1000吨核污染水#',0.00004680), ('#美方减少了从日本进口水产品#',0.00004528), ('#美方到底担心什么呢#',0.00004528), ('#日政客妄言中国游客入境先吃福岛海产#',0.00003888), ('#暂停进口日水产品完全正当合理必要#',0.00003686), ('#日政客称中国游客想入境先喝核废水再吃福岛海产#',0.00032545), ('#日方极端自私中方有权采取防范措施#',0.00003210), ('#俄民众建议所有日本人移居俄罗斯#',0.00003120), ('#东电承认超6成储存核污水放射物超标#',0.00002864), ('#店主为挣钱诱导大家囤盐被抓#',0.00027445), ('#大量日本骚扰电话打进我驻日使领馆#',0.00002560), ('#外交部谈中方对日本水产品采取紧急措施#',0.00021655), ('#对日本水产品采取紧急措施正当合理必要#',0.00021655), ('#岸田文雄试吃福岛海鲜#',0.00002049), ('#日本或向世贸组织起诉中国禁令#',0.00001965), ('#日本将排海的是核污染水并非核废水#',0.00014175), ('#韩政府让企业食堂多吃海鲜引不满#',0.00014175), ('#攀谈攀谈#',0.00001306), ('#日本正采取卑劣手段对中国倒打一耙#',0.00001254), ('#东电前社长自诩极具社会使命感简直是个笑话#',0.00009155), ('#核污染水排放始作俑者居然姓清水#',0.00009155), ('#蛟龙军事#',0.00006335)]
    # keywords2 = [('#日本核污染水排海最新情况#',0.00727200), ('#历史会记住日本政府这一笔#',0.00644288), ('#日本计划今年4次排放核污染水#',0.00337323), ('#日方强行排放核污染水极端自私不负责任#',0.00294110), ('#日本公关核污染水费用大于排污成本#',0.00248035), ('#日本将用700亿日元处理核污染水负面信息#',0.00248035), ('#岸田文雄午餐全是福岛食材#',0.00169580), ('#岸田大赞福岛鱼好吃促国民网购#',0.00167531), ('#浙江查获日本核辐射地区进口食品#',0.00159044), ('#日方反咬中国洗白不了排污入海劣迹#',0.00157366), ('#日本核污染水排海现场画面#',0.00107900), ('#日本核污染水排海4000天后海洋啥样#',0.00106495), ('#全面暂停日本水产品进口#',0.00106151), ('#福岛核电站附近渔港宛如无人区#',0.00051213), ('#主播说联播#',0.00041852), ('#日本为了自己划算不惜让全世界买单#',0.00041852), ('#福岛核污染水排海至少持续30年#',0.00041852), ('#日本核废水排海已经开始影响邻国#',0.00030064), ('#如果核污染水安全日方就没有必要排海#',0.00025493), ('#我国将跟踪研判福岛核污染水排海影响#',0.00021595), ('#我国开展管辖海域海洋辐射环境监测#',0.00021595), ('#3分11秒起底日本的核泄漏黑历史#',0.00014649), ('#一个骗字看日本核污水排海计划#',0.00014649), ('#中国食用盐产量能够满足需求#',0.00011028), ('#核污染水排海非个别国家开绿灯就畅行无阻#',0.00010853), ('#汪文斌反问除了美国还有哪国支持排海#',0.00010853), ('#我驻日本使领馆被大量日本电话骚扰#',0.00010030), ('#东电要求采访记者不能自由录音录像#',0.00009908), ('#总台记者实地探访日本核污染水排出设备#',0.00009908), ('#福岛核电站内部画面#',0.00009908), ('#严禁用日本水产品制作餐食#',0.00007228), ('#市场监管总局加强进口水产品安全抽检#',0.00007228), ('#国际原子能机构报告无法给予排海正当性#',0.00007224), ('#一图看懂日本核污染水排海危害#',0.00070105), ('#核污水排海不是风评被害是实际灾害#',0.00060795), ('#赵立坚#',0.00060005), ('#日本首次排海将持续17天左右#',0.00005555), ('#除了美国日方还能点出哪国支持排海#',0.00005046), ('#日本3天连发5次地震#',0.00048385), ('#福岛真相#',0.00048385), ('#日本已排放超1000吨核污染水#',0.00004680), ('#美方减少了从日本进口水产品#',0.00004528), ('#美方到底担心什么呢#',0.00004528), ('#日政客妄言中国游客入境先吃福岛海产#',0.00003888), ('#暂停进口日水产品完全正当合理必要#',0.00003686), ('#日政客称中国游客想入境先喝核废水再吃福岛海产#',0.00032545), ('#日方极端自私中方有权采取防范措施#',0.00003210), ('#俄民众建议所有日本人移居俄罗斯#',0.00003120), ('#东电承认超6成储存核污水放射物超标#',0.00002864), ('#店主为挣钱诱导大家囤盐被抓#',0.00027445), ('#大量日本骚扰电话打进我驻日使领馆#',0.00002560), ('#外交部谈中方对日本水产品采取紧急措施#',0.00021655), ('#对日本水产品采取紧急措施正当合理必要#',0.00021655), ('#岸田文雄试吃福岛海鲜#',0.00002049), ('#日本或向世贸组织起诉中国禁令#',0.00001965), ('#日本将排海的是核污染水并非核废水#',0.00014175), ('#韩政府让企业食堂多吃海鲜引不满#',0.00014175), ('#攀谈攀谈#',0.00001306), ('#日本正采取卑劣手段对中国倒打一耙#',0.00001254), ('#东电前社长自诩极具社会使命感简直是个笑话#',0.00009155), ('#核污染水排放始作俑者居然姓清水#',0.00009155), ('#蛟龙军事#',0.00006335)]
    # keywords2 = [('广东', 1.1116328972402183), ('江苏', 0.5334370245336557), ('浙江', 0.4854897150082555), ('四川', 0.36536155268822723), ('北京', 0.33534282847342567), ('上海', 0.281970666182456), ('辽宁', 0.280285798297213), ('湖北', 0.26510801089519836), ('福建', 0.255472406012672), ('安徽', 0.2424744940516553), ('河南', 0.2241975815262644), ('湖南', 0.20596386359829538), ('陕西', 0.19360149099488141), ('广西', 0.1859296265744306), ('重庆', 0.17924080799830006), ('黑龙江', 0.12034629341756985), ('天津', 0.11982521052420991), ('江西', 0.10446852766233387), ('山西', 0.09644644486398217), ('吉林', 0.09636441167378963), ('贵州', 0.08346273032574782), ('云南', 0.08227578156014087), ('内蒙古', 0.07956945148840573), ('海南', 0.07814921965949753), ('甘肃', 0.05080539811684198), ('新疆', 0.04461828622589105), ('中国香港', 0.017333362418426864), ('宁夏', 0.01102094680718009), ('新加坡', 0.010310381563390467), ('韩国', 0.008151186054355483), ('马来西亚', 0.007569885883634656), ('德国', 0.006487403274078422), ('加拿大', 0.006451219904400094), ('美国', 0.00487977956287861), ('澳大利亚', 0.004395794787133129), ('中国台湾', 0.004328972258675745), ('澳门', 0.003952045418403381), ('泰国', 0.0035332006123878846), ('阿联酋', 0.0020083517542286923), ('新西兰', 0.001879202579088988), ('西藏', 0.0016687512372387885), ('俄罗斯', 0.001464381402505283), ('法国', 0.001258869991361822), ('英国', 0.001180176006900681)]
    # keywords2 = [('中国', 1012), ('公司', 697), ('市场', 694), ('企业', 507), ('经济', 444), ('美国', 413), ('集团', 342), ('业务', 323), ('国家', 314), ('全球', 286), ('项目', 242), ('行业', 232), ('产品', 230), ('汽车', 229), ('政策', 227), ('国际', 221), ('银行', 219), ('数据', 205), ('资产', 195), ('金融', 188), ('政府', 176), ('风险', 172), ('机构', 158), ('财新', 152), ('贷款', 149), ('价格', 145), ('有限公司', 144), ('基金', 144), ('香港', 138), ('交易', 133), ('能源', 129), ('制造业', 126), ('新能源', 121), ('利率', 118), ('证券', 117), ('债务', 117), ('技术', 116), ('平台', 114), ('资本', 113), ('总统', 113), ('规模', 105), ('上海', 102), ('资金', 102), ('债券', 102), ('疫情', 100), ('北京', 97), ('董事长', 96), ('规定', 95), ('上市', 94), ('科技', 93), ('主席', 93), ('成本', 92), ('城市', 91), ('全国', 90), ('芯片', 88), ('俄罗斯', 88), ('地区', 87), ('人民币', 86), ('电池', 86), ('投资者', 83), ('投资', 81), ('日本', 81), ('品牌', 81), ('客户', 81), ('书记', 79), ('会议', 78), ('工业', 77), ('法院', 76), ('发展', 76), ('用户', 76), ('首席', 74), ('双方', 74), ('计划', 73), ('股份', 72), ('股东', 72), ('部门', 70), ('关系', 70), ('人工智能', 69), ('报告', 69), ('乌克兰', 69), ('政治', 68), ('智能', 67), ('电力', 64), ('世界', 64), ('增长', 63), ('系统', 63), ('服务业', 63), ('订单', 62), ('社会', 62), ('电影', 61), ('欧洲', 61), ('车型', 60), ('半导体', 60), ('能力', 58), ('人员', 57), ('货币', 57), ('个人', 56), ('内地', 56), ('产业', 56), ('协议', 56), ('机制', 55), ('人士', 55), ('保险', 53), ('表示', 53), ('重点', 53), ('存款', 52), ('金融机构', 52), ('股权', 52), ('网络', 52), ('航线', 51), ('委员会', 51), ('内容', 51), ('习近平', 51), ('合作', 51), ('华为', 51), ('居民', 51), ('票房', 50), ('跨境', 50), ('同比', 49), ('电商', 49), ('深圳', 48), ('情况', 48), ('销量', 47), ('峰会', 47), ('上市公司', 47), ('核心', 46), ('库存', 45), ('数字', 45), ('案件', 45), ('供应链', 45), ('基数', 44), ('印度', 43), ('工厂', 43), ('营收', 43), ('业绩', 43), ('航班', 43), ('中央', 41), ('商业', 41), ('水平', 41), ('战略', 41), ('法律', 41), ('降幅', 40), ('专项', 40), ('总经理', 40), ('数量', 40), ('区间', 39), ('铁路', 39), ('住房', 39), ('会见', 39), ('转型', 38), ('环境', 38), ('成员', 38), ('全面', 38), ('消费者', 38), ('运价', 37), ('石油', 37), ('增速', 37), ('时代', 37), ('新闻', 36), ('融资', 36), ('信贷', 36), ('净利润', 36), ('英国', 36), ('信托', 36), ('董事会', 36), ('工作', 36), ('党组', 35), ('中心', 35), ('监管', 35), ('市长', 35), ('体系', 34), ('民营企业', 34), ('商品', 34), ('事故', 34), ('总理', 34), ('货币政策', 34), ('资源', 34), ('管理', 34), ('因素', 33), ('监委', 33), ('德国', 32), ('船舶', 32), ('医院', 32), ('部长', 32), ('制度', 32), ('专业', 32), ('财政部', 32), ('措施', 32), ('材料', 32), ('视频', 32), ('行政', 32), ('行长', 32), ('电动汽车', 32), ('员工', 32), ('会', 32), ('腾讯', 32), ('食品', 32), ('发行', 31), ('以色列', 31), ('法案', 31), ('职务', 31), ('危机', 31), ('汇率', 31), ('整体', 31), ('利润', 31), ('记者', 31), ('压力', 31), ('旗下', 31), ('券商', 30), ('依法', 30), ('中美关系', 30), ('领导人', 30), ('论坛', 30), ('模式', 30), ('区域', 30), ('手机', 30), ('消息', 30), ('韩国', 30), ('协会', 30), ('绿色', 29), ('补贴', 29), ('互联网', 29), ('煤炭', 29), ('储能', 29), ('单位', 29), ('新片', 29), ('泰国', 28), ('广州', 28), ('土地', 28), ('基础设施', 28), ('工程', 28), ('增加值', 28), ('国务院', 28), ('时间', 28), ('党委书记', 27), ('谷歌', 27), ('财富', 27), ('电网', 27), ('游戏', 27), ('物流', 27), ('辽宁省', 27), ('加沙', 27), ('中美', 27), ('广告', 26), ('主题', 26), ('A股', 26), ('天然气', 26), ('和平', 26), ('干部', 26), ('失业率', 26), ('服务', 26), ('航空', 26), ('瓦格纳', 26), ('对话', 26), ('股票', 26), ('副行长', 26), ('警方', 26), ('组织', 26), ('功能', 26), ('沙特', 25), ('联合国', 25), ('场景', 25), ('指标', 25), ('账户', 25), ('事件', 25), ('国家统计局', 25), ('局长', 25), ('台湾', 25), ('印尼', 25), ('消费', 25), ('市委书记', 25), ('农村', 25), ('责任', 25), ('总裁', 25), ('亚洲', 25), ('建设', 25), ('司法', 25), ('两国', 25), ('新加坡', 25)]
    # keywords2 = [('汽车',195), ('企业',183), ('数据',121), ('模型',116), ('新能源',100), ('能源',98), ('平台',82), ('技术',81), ('芯片',81), ('电池',81), ('价格',77), ('品牌',75), ('国家',69), ('用户',67), ('智能',63), ('有限公司',59), ('城市',58), ('车型',58), ('电力',57), ('电影',57), ('上海',55), ('人工智能',54), ('交易',53), ('国际',52), ('财新',52), ('成本',51), ('票房',50), ('半导体',49), ('华为',48), ('政策',48), ('领域',48), ('航线',48), ('电商',45), ('上市',45), ('销量',44), ('工厂',43), ('系统',42), ('计划',42), ('科技',42), ('航班',41), ('全国',41), ('内容',40), ('北京',39), ('客户',39), ('香港',38), ('营收',38), ('欧洲',37), ('运价',36), ('信息',35), ('铁路',33), ('能力',32), ('电动汽车',32), ('董事长',32), ('协议',31), ('日本',31), ('指数',30), ('新片',29), ('腾讯',29), ('部分',29), ('疫情',28), ('储能',28), ('股份',27), ('资产',27), ('政府',27), ('游戏',27), ('电网',27), ('增长',27), ('时代',27), ('机构',27), ('资本',27), ('手机',26), ('业绩',26), ('谷歌',26), ('船舶',26), ('同比',25), ('经济',25), ('资源',25), ('产业',25), ('股东',25), ('订单',24), ('功能',24), ('天然气',24), ('模式',24), ('广告',24), ('视频',23), ('人士',23), ('规模',23), ('股权',22), ('集装箱',22), ('商业',22), ('供应链',22), ('宁德',22), ('航空',22), ('库存',21), ('合作',21), ('楼市',21), ('互联网',21), ('百度',21), ('旗下',21), ('网络',21), ('投资',21), ('比亚迪',21), ('物流',20), ('董事会',20), ('马斯克',20), ('广州',20), ('深圳',19), ('石油',19), ('货运',19), ('资金',19), ('发布',19), ('印度',19), ('数量',19), ('场景',18), ('地区',18), ('消费者',18), ('首席',18), ('乘用车',18), ('主演',18), ('降价',18), ('债务',17), ('材料',17), ('报告',17), ('工业',17), ('股价',17), ('酒店',16), ('英国',16), ('原油',16), ('地产',16), ('转型',16), ('门店',16), ('补贴',16), ('发展',16), ('员工',16), ('净利润',16), ('苹果',16), ('财报',15), ('动力电池',15), ('氢能',15), ('消息',15), ('内地',15), ('方案',15), ('旅客',15), ('算力',15), ('重点',15), ('电动',15), ('AI',14), ('钢铁',14), ('住房',14), ('东南亚',14), ('燃料',14), ('恒大',14), ('数据中心',14), ('车辆',14), ('商家',14), ('渠道',14), ('法案',14), ('矿业',14), ('出口',14), ('机器人',14), ('跨境',14), ('软件',14), ('燃油',14), ('来源',14), ('供应商',14), ('基金',14), ('高通',13), ('德国',13), ('董事',13), ('数字',13), ('京东',13), ('证券',13), ('贷款',13), ('事故',13), ('丰田',13), ('基础设施',12), ('泰国',12), ('居民',12), ('复星',12), ('南京',12), ('整体',12), ('绿色',12), ('租金',12), ('会',12), ('成都',12), ('动力',12), ('港口',12), ('商品',12), ('航运',12), ('合约',12), ('费用',12), ('韩国',11), ('英特尔',11), ('增速',11), ('高端',11), ('实现',11), ('小米',11), ('运营',11), ('收入',11), ('总经理',11), ('高铁',11), ('美团',11), ('战略',11), ('茅台',11), ('机场',11), ('利润',11), ('沙特',11), ('中心',11), ('财季',11), ('俄罗斯',11), ('音乐',11), ('委员会',11), ('时间',11), ('风险',11), ('携程',11), ('核心',11), ('广汽',11), ('季度',11), ('医药',11), ('国产',11)]
    # keywords2 = [('国际', 81), ('俄罗斯', 71), ('乌克兰', 66), ('双方', 62), ('市场', 50), ('政治', 47), ('世界', 47), ('习近平', 46), ('地区', 43), ('企业', 43), ('峰会', 40), ('政府', 39), ('主席', 36), ('日本', 36), ('会见', 36), ('政策', 35), ('中美关系', 29), ('领导人', 28), ('以色列', 28), ('加沙', 27), ('中美', 26), ('瓦格纳', 26), ('会议', 26), ('核心', 25), ('合作', 24), ('冲突', 23), ('巴勒斯坦', 23), ('两国', 23), ('联合国', 23), ('和平', 23), ('债务', 22), ('戈任', 22), ('能源', 22), ('集团', 21), ('普京', 21), ('危机', 21), ('外交部', 21), ('方面', 21), ('对话', 20), ('台湾', 20), ('李强', 19), ('韩国', 18), ('金砖', 18), ('平民', 17), ('王毅', 17), ('法案', 17), ('英国', 17), ('欧洲', 17), ('人民', 17), ('秦刚', 17), ('利率', 17), ('倡议', 16), ('发展', 16), ('称', 16), ('新闻', 16), ('战略', 16), ('气候变化', 16), ('委员会', 16), ('风险', 15), ('耶伦', 15), ('代表', 15), ('毛宁', 15), ('共识', 15), ('部队', 15), ('印度', 15), ('德国', 15), ('法国', 15), ('全面', 14), ('协议', 14), ('交流', 14), ('组织', 14), ('地带', 14), ('印尼', 14), ('气候', 14), ('特朗普', 14), ('媒体', 14), ('军方', 14), ('外长', 13), ('人', 13), ('林肯', 13), ('事件', 13), ('消息', 13), ('七国集团', 13), ('新加坡', 12), ('中欧', 12), ('价格', 12), ('沙特', 12), ('事务', 11), ('立场', 11), ('成员', 11), ('泰国', 11), ('投票', 11), ('鲍威尔', 11), ('成员国', 11), ('土耳其', 10), ('雅加达', 10), ('候选人', 10), ('巴西', 10), ('台海', 10), ('部长', 10), ('苏丹', 10), ('机构', 10), ('马克', 10), ('外交', 10), ('中亚', 9), ('人道主义', 9), ('半导体', 9), ('人员', 9), ('金融', 9), ('武装', 9), ('经贸', 9), ('亚洲', 9), ('货币政策', 9), ('基础', 9), ('技术', 9), ('基辛格', 9), ('国会', 9), ('乌方', 9), ('政党', 9), ('银行', 9), ('北约', 9), ('白俄罗斯', 8), ('北京', 8), ('局势', 8), ('南非', 8), ('医院', 8), ('朝鲜半岛', 8), ('谢锋', 8), ('国务院', 8), ('白宫', 8), ('疫情', 8), ('众议院', 8), ('军事', 8), ('卢卡申科', 8), ('报告', 8), ('压力', 8), ('地震', 8), ('货币', 7), ('消费者', 7), ('首席', 7), ('燃料', 7), ('历史', 7), ('法方', 7), ('时代', 7), ('国务卿', 7), ('一带', 7), ('伊朗', 7), ('官员', 7), ('化石', 7), ('王室', 7), ('石油', 7), ('本币', 7), ('中乌', 7), ('芯片', 7), ('财新网', 7), ('资产', 7), ('人民币', 6), ('部门', 6), ('举行', 6), ('奥卢', 6), ('公民', 6), ('城市', 6), ('实现', 6), ('补贴', 6), ('高铁', 6), ('大使', 6), ('粮食', 6), ('农产品', 6), ('尼日尔', 6), ('卢拉', 6), ('俄方', 6), ('香港', 6), ('食品', 6), ('商品', 6), ('人工智能', 6), ('社交', 6), ('部署', 6), ('警方', 6), ('领导', 6), ('核武器', 6), ('议题', 6), ('文明', 6), ('主权', 6), ('核污染', 6), ('水平', 6), ('投资者', 6), ('包括', 6), ('中亚国家', 6), ('人民党', 6), ('收益率', 6), ('住房', 6), ('反对党', 6), ('财政部', 6)]
    # keywords2 = [('市场', 197), ('银行', 190), ('公司', 183), ('金融', 153), ('中国', 139), ('资产', 130), ('业务', 127), ('贷款', 123), ('风险', 110), ('基金', 110), ('经济', 97), ('企业', 97), ('机构', 94), ('证券', 86), ('利率', 85), ('债券', 78), ('集团', 75), ('交易', 72), ('资本', 69), ('人民币', 69), ('投资者', 67), ('香港', 67), ('产品', 66), ('资金', 62), ('政策', 60), ('规模', 60), ('有限公司', 52), ('行业', 52), ('保险', 47), ('项目', 46), ('存款', 45), ('货币', 44), ('金融机构', 44), ('股东', 43), ('上市', 42), ('董事长', 42), ('投资', 41), ('国际', 41), ('债务', 40), ('股份', 40), ('上市公司', 39), ('方面', 39), ('美国', 38), ('客户', 35), ('问题', 35), ('个人', 34), ('国家', 33), ('发展', 32), ('全球', 32), ('政府', 31), ('信贷', 30), ('信托', 30), ('行长', 30), ('券商', 30), ('领域', 30), ('数据', 29), ('跨境', 28), ('信息', 27), ('监管', 27), ('汇率', 27), ('指数', 26), ('首席', 25), ('股权', 25), ('地方', 25), ('财富', 24), ('数字', 24), ('人士', 24), ('副行长', 24), ('管理', 24), ('机制', 23), ('成本', 23), ('融资', 23), ('余额', 23), ('协会', 23), ('上海', 23), ('内地', 23), ('规定', 23), ('科技', 22), ('报告', 22), ('人寿', 22), ('存量', 21), ('发行', 20), ('工具', 20), ('股票', 20), ('A股', 20), ('总经理', 19), ('净利润', 19), ('寿险', 19), ('部门', 19), ('试点', 18), ('货币政策', 18), ('账户', 18), ('现金', 17), ('北京', 17), ('体系', 17), ('银行业', 17), ('会议', 17), ('平台', 17), ('流动性', 17), ('居民', 17), ('水平', 17), ('负债', 16), ('总裁', 16), ('港股', 16), ('能力', 16), ('情况', 15), ('董事会', 15), ('事务所', 15), ('财务', 15), ('业绩', 15), ('支持', 14), ('估值', 14), ('总局', 14), ('深圳', 14), ('系统', 14), ('息差', 14), ('因素', 14), ('制度', 14), ('交易所', 14), ('财新', 14), ('权益', 13), ('收益', 13), ('养老', 13), ('农村', 13), ('新股', 13), ('自律', 13), ('汽车', 13), ('数量', 13), ('板块', 13), ('重点', 13), ('中心', 13), ('支付', 13), ('中央', 13), ('部分', 13), ('计划', 13), ('商业', 12), ('充足率', 12), ('定价', 12), ('干部', 12), ('价值', 12), ('保险公司', 12), ('外汇', 11), ('住房贷款', 11), ('党委书记', 11), ('费率', 11), ('压力', 11), ('责任', 11), ('资管', 11), ('商业银行', 11), ('总额', 11), ('战略', 11), ('委员会', 11), ('专项', 11), ('实体', 11), ('期货', 10), ('分析师', 10), ('印花税', 10), ('年度', 10), ('技术', 10), ('规范', 10), ('基本', 10), ('董事', 10), ('住房', 10), ('房贷利率', 10), ('民营企业', 10), ('亚洲', 10), ('比例', 10), ('违规', 10), ('监委', 10), ('相关', 10), ('增长', 10), ('价格', 10), ('公告', 10), ('交易商', 10), ('中信', 10), ('基础设施', 10), ('质量', 10), ('高管', 10), ('浙商', 10), ('宏观', 10), ('人员', 9), ('加强', 9), ('工作', 9), ('建设', 9), ('发行人', 9), ('全国', 9), ('旗下', 9), ('手续费', 9), ('新华', 9), ('职务', 9), ('渠道', 9), ('国务院', 9), ('中信银行', 9), ('绿色', 9), ('有所', 9), ('服务', 9), ('范围', 8), ('会', 8), ('党委委员', 8), ('不良贷款', 8), ('办法', 8), ('转型', 8), ('联社', 8), ('薪酬', 8), ('收益率', 8), ('中信证券', 8), ('信托公司', 8), ('理财产品', 8), ('报价', 8), ('财险', 8), ('整体', 8), ('汇金', 8), ('离岸', 8), ('实际', 8), ('国债', 8), ('全面', 8), ('债权人', 8)]
    # keywords2 = [('书记', 70), ('公司', 67), ('中国', 67), ('国家', 61), ('法院', 58), ('规定', 57), ('主席', 38), ('案件', 37), ('集团', 35), ('市长', 34), ('信息', 31), ('北京', 31), ('项目', 30), ('政府', 29), ('党组', 29), ('经济', 29), ('国际', 27), ('人员', 26), ('社会', 25), ('专业', 25), ('财新', 25), ('企业', 25), ('网络', 25), ('行政', 24), ('市委书记', 24), ('法律', 23), ('有限公司', 23), ('司法', 22), ('董事长', 22), ('主题', 22), ('人大常委会', 22), ('香港', 22), ('监委', 21), ('辽宁省', 20), ('职务', 20), ('全国', 20), ('医院', 20), ('事故', 19), ('大会', 18), ('监狱', 18), ('中国足协', 17), ('公安局', 17), ('论坛', 16), ('检察院', 16), ('上海', 16), ('足球', 16), ('律师', 16), ('部门', 16), ('被告人', 16), ('警方', 16), ('消防', 15), ('依法', 15), ('学生', 15), ('党委书记', 15), ('局长', 15), ('委员', 15), ('机关', 15), ('疫情', 15), ('干部', 14), ('土地', 14), ('工作', 14), ('成员', 14), ('副局长', 14), ('山西', 13), ('美国', 13), ('草案', 13), ('环境', 13), ('会议', 13), ('城市', 13), ('河南', 13), ('工程', 12), ('煤炭', 12), ('中央',12), ('国家体育总局', 12), ('北京市', 12), ('副省长', 12), ('科技', 12), ('公民', 12), ('学院', 12), ('公安机关', 12), ('内地', 12), ('新冠', 12), ('上海市', 11), ('全球', 11), ('俱乐部', 11), ('世界', 11), ('中烟', 11), ('委员会', 11), ('平台', 11), ('院长', 11), ('部长', 11), ('农业', 11), ('辽宁', 11), ('犯罪', 11), ('证据', 11), ('中央纪委', 11), ('大学', 11), ('市委常委', 11), ('烟草', 10), ('吉林省', 10), ('当事人', 10), ('江西', 10), ('党组书记', 10), ('中心', 10), ('政治', 10), ('广东省', 10), ('病毒', 10), ('重庆', 10), ('最高法院', 10), ('设施', 10), ('总经理', 10), ('市委', 10), ('责任', 9), ('刑法', 9), ('表示', 9), ('深圳', 9), ('技术', 9), ('发展',9), ('领域', 9), ('云南省', 9), ('江西省', 9), ('云南', 9), ('高院', 9), ('风险', 9), ('程序', 9), ('现场', 9), ('盘锦', 9), ('关系', 8), ('个人信息', 8), ('奥密克', 8), ('全国人大常委会', 8), ('粮食', 8), ('重点', 8), ('洛阳市',8), ('管理局', 8), ('工作人员', 8), ('单位', 8), ('内容', 8), ('法治', 8), ('高官', 8), ('组织', 8), ('药品', 8), ('总队', 8), ('利益', 8), ('农村', 8), ('制度', 8), ('违规', 7), ('民营企业', 7), ('副总经理', 7), ('火灾', 7), ('文件', 7), ('国家烟草专卖局', 7), ('国务院', 7), ('博览会', 7), ('山东', 7), ('秘书长', 7), ('作品', 7), ('人群', 7), ('江苏省', 7), ('小区', 7), ('吉林市', 7), ('方式', 7), ('职责', 7), ('电诈', 7), ('个人', 7), ('盘锦市', 7), ('吉林', 7), ('办案', 7), ('意见', 7), ('毒品', 7), ('金融', 7), ('事发', 7), ('领导',7), ('武汉', 7), ('全面', 7), ('开庭', 7), ('孩子', 7), ('广东', 7), ('山东省', 7), ('行政复议', 7), ('负责人', 7), ('文化', 7), ('缅北', 7), ('政策', 7), ('缅甸', 7), ('一审', 7), ('指数', 7), ('双方', 6), ('发生', 6), ('安徽', 6), ('文物', 6), '广西', 6, ('文学', 6), ('福建', 6), ('变异', 6), ('厅长', 6), ('市场', 6), ('榆林', 6), ('隐患', 6), ('被害人', 6), ('陕西省', 6), ('青海省', 6), ('建议', 6), ('南京', 6), ('资金', 6), ('机制', 6), ('四川', 6), ('中央党校', 6), ('资产', 6), ('纠纷', 6), ('兄弟', 6), ('诈骗', 6), ('病例', 6), ('精神药品', 6), ('电信', 6), ('重庆市', 6), ('庭审', 6), ('黑龙江省', 6), ('银行', 6), ('组织部', 6), ('澳门', 6), ('生产', 6), ('辽阳', 6), ('纪检监察', 6), ('村民', 6), ('代表', 6), ('耕地', 6), ('煤矿', 6)]
    keywords2 = [('经济', 282), ('市场', 265), ('中国', 260), ('企业', 251), ('银行', 191), ('公司', 188), ('金融', 161), ('资产', 147), ('风险', 136), ('政策', 135), ('业务', 134), ('贷款', 130), ('行业', 125), ('基金', 120), ('指数', 117), ('制造业', 113), ('机构', 108), ('证券',98), ('利率', 98), ('债券', 91), ('产品', 83), ('资本', 79), ('集团', 77), ('政府', 76), ('规模', 76), ('财新', 73), ('债务', 73), ('交易', 73), ('香港', 72), ('资金', 72), ('全球', 69), ('项目', 69), ('人民币', 69), ('投资者', 67), ('国际', 59), ('数据',59), ('方面', 58), ('有限公司', 58), ('服务业', 57), ('美国', 56), ('价格', 56), ('工业', 54), ('国家', 53), ('投资', 52), ('保险', 49), ('金融机构', 48), ('货币', 47), ('存款', 47), ('首席', 47), ('领域', 46), ('股东', 43), ('疫情', 43), ('上市', 42), ('董事长', 42), ('部分', 41), ('基数', 41), ('股份', 40), ('降幅', 39), ('客户', 39), ('上市公司', 39), ('订单', 37), ('成本', 36), ('发展', 35), ('报告', 34), ('增长', 32), ('信贷', 32), ('机制', 32), ('科技', 32), ('跨境', 31), ('居民', 31), ('会议', 30), ('信息', 30), ('行长', 30), ('信托', 30), ('监管', 30), ('券商', 30), ('内地', 29), ('重点', 29), ('专项', 29), ('规定', 29), ('数字', 28), ('融资', 27), ('汇率', 27), ('增加值', 27), ('因素', 27), ('股权', 26), ('财富', 26), ('汽车', 25), ('产业', 25), ('人士', 25), ('管理', 25), ('存量', 24), ('货币政策', 24), ('副行长', 24), ('失业率', 24), ('全国', 24), ('社会', 24), ('上海', 24), ('增速', 24), ('财政部', 23), ('协会', 23), ('水平', 23), ('民营企业', 23), ('余额', 23), ('同比', 23), ('发行', 23), ('中央', 22), ('宏观', 22), ('能力', 22), ('人寿', 22), ('体系', 22), ('试点', 21), ('制度', 21), ('A股', 20), ('工具', 20), ('利润', 20), ('账户', 20), ('股票', 20), ('下降', 20), ('库存', 20), ('国家统计局', 20), ('平台', 20), ('食品', 20), ('深圳', 20), ('地区', 19), ('扩张', 19), ('寿险', 19), ('财务', 19), ('净利润', 19), ('分析师', 19), ('计划', 19), ('总经理', 19), ('供应链', 18), ('负债', 18), ('银行业', 18), ('涨幅', 18), ('流动性', 18), ('北京', 18), ('转型', 18), ('指标', 18), ('商会', 18), ('住房', 18), ('现金', 17), ('港股', 17), ('压力', 17), ('劳动力', 17), ('事务所', 16), ('收益', 16), ('服务', 16), ('信心', 16), ('总裁', 16), ('城镇', 16), ('单位', 16), ('总局', 16), ('财政', 15), ('PMI', 15), ('预期', 15), ('整体', 15), ('全面', 15), ('新能源', 15), ('定价', 15), ('支付', 15), ('董事会', 15), ('技术', 15), ('措施', 15), ('支持', 15), ('农村', 15), ('相关', 15), ('环境', 15), ('业绩', 15), ('经济体', 14), ('系统', 14), ('工作', 14), ('交易所', 14), ('消费', 14), ('总额', 14), ('息差', 14), ('估值', 14), ('经济学家', 14), ('建设', 13), ('实体', 13), ('商业', 13), ('权益', 13), ('养老', 13), ('基础设施', 13), ('基本', 13), ('商品', 13), ('数量', 13), ('区域', 13), ('付凌晖', 13), ('规范', 13), ('板块', 13), ('自律', 13), ('人员', 13), ('国债', 13), ('价值', 13), ('有所',13), ('新股', 13), ('盈利', 13), ('充足率', 12), ('产业链', 12), ('海南', 12), ('住房贷款', 12), ('统计局', 12), ('质量', 12), ('总体', 12), ('绿色', 12), ('国务院', 12), ('亚洲', 12), ('干部', 12), ('战略', 12), ('比例', 12), ('景气', 12), ('保险公司', 12), ('材料',12), ('期货', 12), ('城市', 12), ('商业银行', 11), ('力度', 11), ('就业', 11), ('责任', 11), ('印花税', 11), ('公告', 11), ('税收', 11), ('改革', 11), ('资管', 11), ('消费者', 11), ('增值税', 11), ('规则', 11), ('外汇', 11), ('依法', 11), ('费率', 11), ('委员会', 11), ('民间', 11), ('营业', 11), ('党委书记', 11), ('年度', 11), ('房地产', 10), ('中信', 10), ('优惠政策', 10), ('增幅', 10), ('范围', 10), ('浙商', 10), ('信用', 10), ('外资', 10), ('标准', 10), ('出口', 10), ('高管', 10), ('预计', 10), ('董事', 10), ('煤炭',10), ('收入', 10), ('房贷利率', 10), ('违规', 10), ('监委', 10), ('交易商', 10), ('收益率', 10)]
    # keywords2 = [('#日本就中国暂停进口水产品向WTO提交文件#', 1.1116328972402183), ('#日本称为应对中国禁令已砸千亿日元#', 0.6334370245336557), ('#日方称中方是唯一反对核污水排海国家#', 0.6854897150082555), ('#福岛核电站周边海水检测出放射性氚#', 0.66536155268822723), ('#日本反对他国直接取样独立检测#', 0.68534282847342567), ('#韩国派驻福岛专家考察通报引质疑#', 0.451879202579088988), ('#日本计划明年3月底前排放4轮核污染水#', 0.4016687512372387885), ('#日本为非作恶居然还倒打一耙#', 0.381258869991361822), ('#日本前首相批排污入海#', 0.351643814025283), ('#日本前首相称核污染水换名也改不了事实#', 0.3415886999136822), ('#日本核污水排海口附近首次检测到氚#', 0.2515886999136822), ('#日本研究机构发现放射性物质泄漏#', 0.1515886999136822), ('#日本原子能研究有员工吸入放射性粉末#', 0.1315886999136822), ('#日本政府卖力的表演更加说明排海有问题#', 0.0915886999136822), ('#日本核污水57天将污染半个太平洋#', 0.0815886999136822)]

    for word in keywords2:
        # print(word)
        ret_words[word[0]] = word[1]

    generate_word_cloud(ret_words, path2)

    return keywords

    # # Top 100 名词
    # words = []
    # for w in word:
    #     if w.flag[0] == 'n':
    #         words.append(w.word)
    #
    # path3 = path2 + '.csv'
    # keywords = extract_tags(text, topK=100,withWeight=True)
    # with open(path3, 'w') as myFile:
    #     myWriter = csv.writer(myFile)
    #     for keyword, weight in extract_tags(text, topK=100, withWeight=True):
    #         if keyword in words:
    #             print(keyword, str(weight))
    #             myWriter.writerow([keyword, weight])
    #
    # ret_words = {}
    # for word in keywords:
    #     print(word)
    #     if word[0] in words:
    #         ret_words[word[0]] = word[1]
    # generate_word_cloud(ret_words,path2)
    #
    # words = []
    # f = open('D:\Python\Project\Meifu\Meifu\stopwords-master\正面情感词语（中文）.txt', 'r', encoding='utf-8')
    # for i in f.readlines():
    #     words.append(i.strip('\n'))
    # f.close()
    # # print('words',words)
    # f = open('D:\Python\Project\Meifu\Meifu\stopwords-master\正面评价词语（中文）.txt', 'r', encoding='utf-8')
    # for i in f.readlines():
    #     words.append(i.strip('\n'))
    # f.close()
    # # print('words',words)
    # f = open('D:\Python\Project\Meifu\Meifu\stopwords-master\负面情感词语（中文）.txt', 'r', encoding='utf-8')
    # for i in f.readlines():
    #     words.append(i.strip('\n'))
    # f.close()
    # # print('words',words)
    # f = open('D:\Python\Project\Meifu\Meifu\stopwords-master\负面评价词语（中文）.txt', 'r', encoding='utf-8')
    # for i in f.readlines():
    #     words.append(i.strip('\n'))
    # f.close()
    # print('words',words)
    #
    # keywords = extract_tags(text, topK=2000,withWeight=True)
    # ret_words = {}
    # for word in keywords:
    #     if word[0] in words:
    #         ret_words[word[0]] = word[1]
    # print(ret_words)
    # generate_word_cloud(ret_words,path2)
    # return keywords

# 4.生成词云图并保存
def generate_word_cloud(dict, path):
    # color_mask = imread('./background.jpg')
    cloud = WordCloud(
        # 设置字体，不指定就会出现乱码，文件名不支持中文
        # font_path="C:/Windows/Fonts/simkai.ttf",
        font_path="/mnt/c/Windows/Fonts/simsun.ttc",
        # font_path=path.join(d,'simsun.ttc'),
        # 设置背景色，默认为黑，可根据需要自定义为颜色
        background_color='white',
        # 清晰度
        scale=16,
        # 词云形状，
        # mask=color_mask,
        # 允许最大词汇
        max_words=400,
        # 最大号字体，如果不指定则为图像高度
        max_font_size=150,
        # 画布宽度和高度，如果设置了mask则不会生效
        # width=200,
        # height=200,
        # 词语水平摆放的频率，默认为0.9.即竖直摆放的频率为0.1
        prefer_horizontal=0.8
    )
    cloud.generate_from_frequencies(frequencies=dict)
    print(path)
    cloud.to_file(path)
    # # plt.imshow(cloud)
    # # 不现实坐标轴
    # plt.axis('off')
    # # 绘制词云
    # plt.figure(dpi = 600)
    # # image_colors = ImageColorGenerator(color_mask)
    # # # 重新上色
    # # plt.imshow(cloud.recolor(color_func=image_colors))
    # # 保存图片
    # plt.savefig('./result2.png')
    # plt.show()

if __name__ == '__main__':
    txt= '十八大以来的五年，4s是党和国家发展进程中极不平凡的五年。面对世界经济复苏乏力、局部冲突和动荡频发、全球性问题加剧的外部环境，面对我国经济发展进入新常态等一系列深刻变化，我们坚持稳中求进工作总基调，迎难而上，开拓进取，取得了改革开放和社会主义现代化建设的历史性成就。'
    # txt, sentences = text_abstract.get_text('汽车之家 跟帖 美孚.xlsx')
    # get_keywords(txt, '1234.jpg')

    import csv

    headers = ['class', 'name', 'sex', 'height', 'year']

    rows = [
        [1, 'xiaoming', 'male', 168, 23],
        [1, 'xiaohong', 'female', 162, 22],
        [2, 'xiaozhang', 'female', 163, 21],
        [2, 'xiaoli', 'male', 158, 21]
    ]

    with open('test.csv', 'w')as f:
        f_csv = csv.writer(f)
        f_csv.writerow(headers)
        f_csv.writerows(rows)

    #
    # print('----')
    #
    # txt, sentences = text_abstract.get_text('汽车之家 跟帖 嘉实多.xlsx')
    # get_keywords(txt, 'Castrol.jpg')
    #
    # print('----')
    #
    # txt, sentences = text_abstract.get_text('汽车之家 跟帖 壳牌.xlsx')
    # get_keywords(txt, 'Shell.jpg')

